create_clock -name vclk -period 15 
set_clock_uncertainty -setup 1.5 [get_clocks vclk]
set_input_delay -max 4.5 -clock vclk [all_inputs]
set_output_delay -max 4.5 -clock vclk [all_outputs]
set_driving_cell -lib_cell INVX8 [all_inputs]
set_load 100 [all_outputs]
